apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
#define LEDC_DUTY_INC_HSCH7  (BIT(30))
#define LEDC_DUTY_INC_HSCH7_M  (BIT(30))
#define LEDC_DUTY_INC_HSCH7_V  0x1
#define LEDC_DUTY_INC_HSCH7_S  30

/* LEDC_DUTY_NUM_HSCH7 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */

/* Description: This register is used to control the num of increased
 * or decreased times for high speed channel6.
 */

#define LEDC_DUTY_NUM_HSCH7  0x000003FF
#define LEDC_DUTY_NUM_HSCH7_M  ((LEDC_DUTY_NUM_HSCH7_V)<<(LEDC_DUTY_NUM_HSCH7_S))
#define LEDC_DUTY_NUM_HSCH7_V  0x3FF
#define LEDC_DUTY_NUM_HSCH7_S  20

/* LEDC_DUTY_CYCLE_HSCH7 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */

/* Description: This register is used to increase or decrease
 * the duty every reg_duty_cycle_hsch7 cycles for high speed channel7.
 */

#define LEDC_DUTY_CYCLE_HSCH7  0x000003FF
#define LEDC_DUTY_CYCLE_HSCH7_M  ((LEDC_DUTY_CYCLE_HSCH7_V)<<(LEDC_DUTY_CYCLE_HSCH7_S))
#define LEDC_DUTY_CYCLE_HSCH7_V  0x3FF
#define LEDC_DUTY_CYCLE_HSCH7_S  10

/* LEDC_DUTY_SCALE_HSCH7 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */

/* Description: This register controls the increase or decrease
 * step scale for high speed channel7.
 */

#define LEDC_DUTY_SCALE_HSCH7  0x000003FF
#define LEDC_DUTY_SCALE_HSCH7_M  ((LEDC_DUTY_SCALE_HSCH7_V)<<(LEDC_DUTY_SCALE_HSCH7_S))
#define LEDC_DUTY_SCALE_HSCH7_V  0x3FF
#define LEDC_DUTY_SCALE_HSCH7_S  0

#define LEDC_HSCH7_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x009C)

/* LEDC_DUTY_HSCH7 : RO ;bitpos:[24:0] ;default: 25'h0 ; */

/* Description: This register represents the current duty of the output
 * signal for high speed channel7.
 */

#define LEDC_DUTY_HSCH7  0x01FFFFFF
#define LEDC_DUTY_HSCH7_M  ((LEDC_DUTY_HSCH7_V)<<(LEDC_DUTY_HSCH7_S))
#define LEDC_DUTY_HSCH7_V  0x1FFFFFF
#define LEDC_DUTY_HSCH7_S  0

#define LEDC_LSCH0_CONF0_REG          (DR_REG_LEDC_BASE + 0x00A0)

/* LEDC_PARA_UP_LSCH0 : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: This bit is used to update register LEDC_LSCH0_HPOINT
 * and LEDC_LSCH0_DUTY for low speed channel0.
 */

#define LEDC_PARA_UP_LSCH0  (BIT(4))
#define LEDC_PARA_UP_LSCH0_M  (BIT(4))
#define LEDC_PARA_UP_LSCH0_V  0x1
#define LEDC_PARA_UP_LSCH0_S  4

/* LEDC_IDLE_LV_LSCH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: This bit is used to control the output value
 * when low speed channel0 is off.
 */

#define LEDC_IDLE_LV_LSCH0  (BIT(3))
#define LEDC_IDLE_LV_LSCH0_M  (BIT(3))
#define LEDC_IDLE_LV_LSCH0_V  0x1
#define LEDC_IDLE_LV_LSCH0_S  3

/* LEDC_SIG_OUT_EN_LSCH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: This is the output enable control bit
 * for low speed channel0.
 */

#define LEDC_SIG_OUT_EN_LSCH0  (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH0_M  (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH0_V  0x1
#define LEDC_SIG_OUT_EN_LSCH0_S  2

/* LEDC_TIMER_SEL_LSCH0 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */

/* Description: There are four low speed timers  the two bits
 * are used to select one of them for low speed channel0.
 * 2'b00: seletc lstimer0.
 * 2'b01: select lstimer1.
 * 2'b10: select lstimer2.
 * 2'b11: select lstimer3.
 */

#define LEDC_TIMER_SEL_LSCH0  0x00000003
#define LEDC_TIMER_SEL_LSCH0_M  ((LEDC_TIMER_SEL_LSCH0_V)<<(LEDC_TIMER_SEL_LSCH0_S))
#define LEDC_TIMER_SEL_LSCH0_V  0x3
#define LEDC_TIMER_SEL_LSCH0_S  0

#define LEDC_LSCH0_HPOINT_REG          (DR_REG_LEDC_BASE + 0x00A4)

/* LEDC_HPOINT_LSCH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */

/* Description: The output value changes to high when
 * lstimerx(x=[0 3]) selected by low speed channel0 has reached
 * reg_hpoint_lsch0[19:0]
 */

#define LEDC_HPOINT_LSCH0  0x000FFFFF
#define LEDC_HPOINT_LSCH0_M  ((LEDC_HPOINT_LSCH0_V)<<(LEDC_HPOINT_LSCH0_S))
#define LEDC_HPOINT_LSCH0_V  0xFFFFF
#define LEDC_HPOINT_LSCH0_S  0

#define LEDC_LSCH0_DUTY_REG          (DR_REG_LEDC_BASE + 0x00A8)

/* LEDC_DUTY_LSCH0 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */

/* Description: The register is used to control output duty.
 * When lstimerx(x=[0 3]) chosen by low speed channel0 has reached
 * reg_lpoint_lsch0 the output signal changes to low.
 * reg_lpoint_lsch0=(reg_hpoint_lsch0[19:0]+reg_duty_lsch0[24:4]) (1)
 * reg_lpoint_lsch0=(reg_hpoint_lsch0[19:0]+reg_duty_lsch0[24:4] + 1) (2)
 * The least four bits in this register represent the decimal part
 * and determines when to choose (1) or (2)
 */

#define LEDC_DUTY_LSCH0  0x01FFFFFF
#define LEDC_DUTY_LSCH0_M  ((LEDC_DUTY_LSCH0_V)<<(LEDC_DUTY_LSCH0_S))
#define LEDC_DUTY_LSCH0_V  0x1FFFFFF
#define LEDC_DUTY_LSCH0_S  0

#define LEDC_LSCH0_CONF1_REG          (DR_REG_LEDC_BASE + 0x00AC)

/* LEDC_DUTY_START_LSCH0 : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When reg_duty_num_hsch1 reg_duty_cycle_hsch1
 * and reg_duty_scale_hsch1 has been configured. These registers
 * won't take effect until set reg_duty_start_hsch1. This bit
 * is automatically cleared by hardware.
 */

#define LEDC_DUTY_START_LSCH0  (BIT(31))
#define LEDC_DUTY_START_LSCH0_M  (BIT(31))
#define LEDC_DUTY_START_LSCH0_V  0x1
#define LEDC_DUTY_START_LSCH0_S  31

/* LEDC_DUTY_INC_LSCH0 : R/W ;bitpos:[30] ;default: 1'b1 ; */

/* Description: This register is used to increase the duty
 * of output signal or decrease the duty of output signal
 * for low speed channel6.
 */

#define LEDC_DUTY_INC_LSCH0  (BIT(30))
#define LEDC_DUTY_INC_LSCH0_M  (BIT(30))
#define LEDC_DUTY_INC_LSCH0_V  0x1
#define LEDC_DUTY_INC_LSCH0_S  30

/* LEDC_DUTY_NUM_LSCH0 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */

/* Description: This register is used to control the num of increased
 * or decreased times for low speed channel6.
 */

#define LEDC_DUTY_NUM_LSCH0  0x000003FF
#define LEDC_DUTY_NUM_LSCH0_M  ((LEDC_DUTY_NUM_LSCH0_V)<<(LEDC_DUTY_NUM_LSCH0_S))
#define LEDC_DUTY_NUM_LSCH0_V  0x3FF
#define LEDC_DUTY_NUM_LSCH0_S  20

/* LEDC_DUTY_CYCLE_LSCH0 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */

/* Description: This register is used to increase
 * or decrease the duty every reg_duty_cycle_lsch0 cycles
 * for low speed channel0.
 */

#define LEDC_DUTY_CYCLE_LSCH0  0x000003FF
#define LEDC_DUTY_CYCLE_LSCH0_M  ((LEDC_DUTY_CYCLE_LSCH0_V)<<(LEDC_DUTY_CYCLE_LSCH0_S))
#define LEDC_DUTY_CYCLE_LSCH0_V  0x3FF
#define LEDC_DUTY_CYCLE_LSCH0_S  10

/* LEDC_DUTY_SCALE_LSCH0 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */

/* Description: This register controls the increase or decrease
 * step scale for low speed channel0.
 */

