apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* LEDC_DUTY_LSCH6 : RO ;bitpos:[24:0] ;default: 25'h0 ; */

/* Description: This register represents the current duty
 * of the output signal for low speed channel6.
 */

#define LEDC_DUTY_LSCH6  0x01FFFFFF
#define LEDC_DUTY_LSCH6_M  ((LEDC_DUTY_LSCH6_V)<<(LEDC_DUTY_LSCH6_S))
#define LEDC_DUTY_LSCH6_V  0x1FFFFFF
#define LEDC_DUTY_LSCH6_S  0

#define LEDC_LSCH7_CONF0_REG          (DR_REG_LEDC_BASE + 0x012C)

/* LEDC_PARA_UP_LSCH7 : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: This bit is used to update register LEDC_LSCH7_HPOINT
 * and LEDC_LSCH7_DUTY for low speed channel7.
 */

#define LEDC_PARA_UP_LSCH7  (BIT(4))
#define LEDC_PARA_UP_LSCH7_M  (BIT(4))
#define LEDC_PARA_UP_LSCH7_V  0x1
#define LEDC_PARA_UP_LSCH7_S  4

/* LEDC_IDLE_LV_LSCH7 : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: This bit is used to control the output
 * value when low speed channel7 is off.
 */

#define LEDC_IDLE_LV_LSCH7  (BIT(3))
#define LEDC_IDLE_LV_LSCH7_M  (BIT(3))
#define LEDC_IDLE_LV_LSCH7_V  0x1
#define LEDC_IDLE_LV_LSCH7_S  3

/* LEDC_SIG_OUT_EN_LSCH7 : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: This is the output enable control bit
 * for low speed channel7.
 */

#define LEDC_SIG_OUT_EN_LSCH7  (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH7_M  (BIT(2))
#define LEDC_SIG_OUT_EN_LSCH7_V  0x1
#define LEDC_SIG_OUT_EN_LSCH7_S  2

/* LEDC_TIMER_SEL_LSCH7 : R/W ;bitpos:[1:0] ;default: 2'd0 ; */

/* Description: There are four low speed timers the two bits
 * are used to select one of them for low speed channel7.
 * 2'b00: seletc lstimer0.
 * 2'b01: select lstimer1.
 * 2'b10: select lstimer2.
 * 2'b11: select lstimer3.
 */

#define LEDC_TIMER_SEL_LSCH7  0x00000003
#define LEDC_TIMER_SEL_LSCH7_M  ((LEDC_TIMER_SEL_LSCH7_V)<<(LEDC_TIMER_SEL_LSCH7_S))
#define LEDC_TIMER_SEL_LSCH7_V  0x3
#define LEDC_TIMER_SEL_LSCH7_S  0

#define LEDC_LSCH7_HPOINT_REG          (DR_REG_LEDC_BASE + 0x0130)

/* LEDC_HPOINT_LSCH7 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */

/* Description: The output value changes to high when
 * lstimerx(x=[0 3]) selected by low speed channel7 has reached
 * reg_hpoint_lsch7[19:0]
 */

#define LEDC_HPOINT_LSCH7  0x000FFFFF
#define LEDC_HPOINT_LSCH7_M  ((LEDC_HPOINT_LSCH7_V)<<(LEDC_HPOINT_LSCH7_S))
#define LEDC_HPOINT_LSCH7_V  0xFFFFF
#define LEDC_HPOINT_LSCH7_S  0

#define LEDC_LSCH7_DUTY_REG          (DR_REG_LEDC_BASE + 0x0134)

/* LEDC_DUTY_LSCH7 : R/W ;bitpos:[24:0] ;default: 25'h0 ; */

/* Description: The register is used to control output duty.
 * When lstimerx(x=[0 3]) chosen by low speed channel7 has reached
 * reg_lpoint_lsch7 the output signal changes to low.
 * reg_lpoint_lsch7=(reg_hpoint_lsch7[19:0]+reg_duty_lsch7[24:4]) (1)
 * reg_lpoint_lsch7=(reg_hpoint_lsch7[19:0]+reg_duty_lsch7[24:4] + 1) (2)
 * The least four bits in this register represent the decimal part
 * and determines when to choose (1) or (2)
 */

#define LEDC_DUTY_LSCH7  0x01FFFFFF
#define LEDC_DUTY_LSCH7_M  ((LEDC_DUTY_LSCH7_V)<<(LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V  0x1FFFFFF
#define LEDC_DUTY_LSCH7_S  0

#define LEDC_LSCH7_CONF1_REG          (DR_REG_LEDC_BASE + 0x0138)

/* LEDC_DUTY_START_LSCH7 : R/W ;bitpos:[31] ;default: 1'b0 ; */

/* Description: When reg_duty_num_hsch4 reg_duty_cycle_hsch4
 * and reg_duty_scale_hsch4 has been configured. These registers
 * won't take effect until set reg_duty_start_hsch4. This bit
 * is automatically cleared by hardware.
 */

#define LEDC_DUTY_START_LSCH7  (BIT(31))
#define LEDC_DUTY_START_LSCH7_M  (BIT(31))
#define LEDC_DUTY_START_LSCH7_V  0x1
#define LEDC_DUTY_START_LSCH7_S  31

/* LEDC_DUTY_INC_LSCH7 : R/W ;bitpos:[30] ;default: 1'b1 ; */

/* Description: This register is used to increase the duty
 * of output signal or decrease the duty of output signal
 * for low speed channel4.
 */

#define LEDC_DUTY_INC_LSCH7  (BIT(30))
#define LEDC_DUTY_INC_LSCH7_M  (BIT(30))
#define LEDC_DUTY_INC_LSCH7_V  0x1
#define LEDC_DUTY_INC_LSCH7_S  30

/* LEDC_DUTY_NUM_LSCH7 : R/W ;bitpos:[29:20] ;default: 10'h0 ; */

/* Description: This register is used to control the num of increased
 * or decreased times for low speed channel4.
 */

#define LEDC_DUTY_NUM_LSCH7  0x000003FF
#define LEDC_DUTY_NUM_LSCH7_M  ((LEDC_DUTY_NUM_LSCH7_V)<<(LEDC_DUTY_NUM_LSCH7_S))
#define LEDC_DUTY_NUM_LSCH7_V  0x3FF
#define LEDC_DUTY_NUM_LSCH7_S  20

/* LEDC_DUTY_CYCLE_LSCH7 : R/W ;bitpos:[19:10] ;default: 10'h0 ; */

/* Description: This register is used to increase or decrease
 * the duty every reg_duty_cycle_lsch7 cycles for low speed channel7.
 */

#define LEDC_DUTY_CYCLE_LSCH7  0x000003FF
#define LEDC_DUTY_CYCLE_LSCH7_M  ((LEDC_DUTY_CYCLE_LSCH7_V)<<(LEDC_DUTY_CYCLE_LSCH7_S))
#define LEDC_DUTY_CYCLE_LSCH7_V  0x3FF
#define LEDC_DUTY_CYCLE_LSCH7_S  10

/* LEDC_DUTY_SCALE_LSCH7 : R/W ;bitpos:[9:0] ;default: 10'h0 ; */

/* Description: This register controls the increase or decrease
 * step scale for low speed channel7.
 */

#define LEDC_DUTY_SCALE_LSCH7  0x000003FF
#define LEDC_DUTY_SCALE_LSCH7_M  ((LEDC_DUTY_SCALE_LSCH7_V)<<(LEDC_DUTY_SCALE_LSCH7_S))
#define LEDC_DUTY_SCALE_LSCH7_V  0x3FF
#define LEDC_DUTY_SCALE_LSCH7_S  0

#define LEDC_LSCH7_DUTY_R_REG          (DR_REG_LEDC_BASE + 0x013C)

/* LEDC_DUTY_LSCH7 : RO ;bitpos:[24:0] ;default: 25'h0 ; */

/* Description: This register represents the current duty
 * of the output signal for low speed channel7.
 */

#define LEDC_DUTY_LSCH7  0x01FFFFFF
#define LEDC_DUTY_LSCH7_M  ((LEDC_DUTY_LSCH7_V)<<(LEDC_DUTY_LSCH7_S))
#define LEDC_DUTY_LSCH7_V  0x1FFFFFF
#define LEDC_DUTY_LSCH7_S  0

#define LEDC_HSTIMER0_CONF_REG          (DR_REG_LEDC_BASE + 0x0140)

/* LEDC_TICK_SEL_HSTIMER0 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose apb_clk or ref_tick
 * for high speed timer0.
 * 1'b1:apb_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_HSTIMER0  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER0_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER0_V  0x1
#define LEDC_TICK_SEL_HSTIMER0_S  25

/* LEDC_HSTIMER0_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset high speed timer0
 * the counter will be 0 after reset.
 */

#define LEDC_HSTIMER0_RST  (BIT(24))
#define LEDC_HSTIMER0_RST_M  (BIT(24))
#define LEDC_HSTIMER0_RST_V  0x1
#define LEDC_HSTIMER0_RST_S  24

/* LEDC_HSTIMER0_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in high speed timer0 */

#define LEDC_HSTIMER0_PAUSE  (BIT(23))
#define LEDC_HSTIMER0_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER0_PAUSE_V  0x1
#define LEDC_HSTIMER0_PAUSE_S  23

/* LEDC_DIV_NUM_HSTIMER0 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter for divider
 * in high speed timer0 the least significant eight bits represent the
 * decimal part.
 */

#define LEDC_DIV_NUM_HSTIMER0  0x0003FFFF
#define LEDC_DIV_NUM_HSTIMER0_M  ((LEDC_DIV_NUM_HSTIMER0_V)<<(LEDC_DIV_NUM_HSTIMER0_S))
#define LEDC_DIV_NUM_HSTIMER0_V  0x3FFFF
#define LEDC_DIV_NUM_HSTIMER0_S  5

/* LEDC_HSTIMER0_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in high speed timer0. the counter range is [0 2**reg_hstimer0_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_HSTIMER0_DUTY_RES  0x0000001F
#define LEDC_HSTIMER0_DUTY_RES_M  ((LEDC_HSTIMER0_DUTY_RES_V)<<(LEDC_HSTIMER0_DUTY_RES_S))
#define LEDC_HSTIMER0_DUTY_RES_V  0x1F
#define LEDC_HSTIMER0_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

