apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
#define LEDC_HSTIMER0_LIM         LEDC_HSTIMER0_DUTY_RES
#define LEDC_HSTIMER0_LIM_M       LEDC_HSTIMER0_DUTY_RES_M
#define LEDC_HSTIMER0_LIM_V       LEDC_HSTIMER0_DUTY_RES_V
#define LEDC_HSTIMER0_LIM_S       LEDC_HSTIMER0_DUTY_RES_S

#define LEDC_HSTIMER0_VALUE_REG          (DR_REG_LEDC_BASE + 0x0144)

/* LEDC_HSTIMER0_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in high speed timer0
 */

#define LEDC_HSTIMER0_CNT  0x000FFFFF
#define LEDC_HSTIMER0_CNT_M  ((LEDC_HSTIMER0_CNT_V)<<(LEDC_HSTIMER0_CNT_S))
#define LEDC_HSTIMER0_CNT_V  0xFFFFF
#define LEDC_HSTIMER0_CNT_S  0

#define LEDC_HSTIMER1_CONF_REG          (DR_REG_LEDC_BASE + 0x0148)

/* LEDC_TICK_SEL_HSTIMER1 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose apb_clk or ref_tick
 * for high speed timer1. 1'b1:apb_clk  0:ref_tick
 */

#define LEDC_TICK_SEL_HSTIMER1  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER1_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER1_V  0x1
#define LEDC_TICK_SEL_HSTIMER1_S  25

/* LEDC_HSTIMER1_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset high speed timer1 the counter
 * will be 0 after reset.
 */

#define LEDC_HSTIMER1_RST  (BIT(24))
#define LEDC_HSTIMER1_RST_M  (BIT(24))
#define LEDC_HSTIMER1_RST_V  0x1
#define LEDC_HSTIMER1_RST_S  24

/* LEDC_HSTIMER1_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in high speed timer1 */

#define LEDC_HSTIMER1_PAUSE  (BIT(23))
#define LEDC_HSTIMER1_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER1_PAUSE_V  0x1
#define LEDC_HSTIMER1_PAUSE_S  23

/* LEDC_DIV_NUM_HSTIMER1 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter
 * for divider in high speed timer1 the least significant eight bits
 * represent the decimal part.
 */

#define LEDC_DIV_NUM_HSTIMER1  0x0003FFFF
#define LEDC_DIV_NUM_HSTIMER1_M  ((LEDC_DIV_NUM_HSTIMER1_V)<<(LEDC_DIV_NUM_HSTIMER1_S))
#define LEDC_DIV_NUM_HSTIMER1_V  0x3FFFF
#define LEDC_DIV_NUM_HSTIMER1_S  5

/* LEDC_HSTIMER1_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in high speed timer1. the counter range is [0 2**reg_hstimer1_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_HSTIMER1_DUTY_RES  0x0000001F
#define LEDC_HSTIMER1_DUTY_RES_M  ((LEDC_HSTIMER1_DUTY_RES_V)<<(LEDC_HSTIMER1_DUTY_RES_S))
#define LEDC_HSTIMER1_DUTY_RES_V  0x1F
#define LEDC_HSTIMER1_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_HSTIMER1_LIM       LEDC_HSTIMER1_DUTY_RES
#define LEDC_HSTIMER1_LIM_M     LEDC_HSTIMER1_DUTY_RES_M
#define LEDC_HSTIMER1_LIM_V     LEDC_HSTIMER1_DUTY_RES_V
#define LEDC_HSTIMER1_LIM_S     LEDC_HSTIMER1_DUTY_RES_S

#define LEDC_HSTIMER1_VALUE_REG          (DR_REG_LEDC_BASE + 0x014C)

/* LEDC_HSTIMER1_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current counter
 * value in high speed timer1.
 */

#define LEDC_HSTIMER1_CNT  0x000FFFFF
#define LEDC_HSTIMER1_CNT_M  ((LEDC_HSTIMER1_CNT_V)<<(LEDC_HSTIMER1_CNT_S))
#define LEDC_HSTIMER1_CNT_V  0xFFFFF
#define LEDC_HSTIMER1_CNT_S  0

#define LEDC_HSTIMER2_CONF_REG          (DR_REG_LEDC_BASE + 0x0150)

/* LEDC_TICK_SEL_HSTIMER2 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose apb_clk or ref_tick for high
 * speed timer2.
 * 1:apb_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_HSTIMER2  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER2_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER2_V  0x1
#define LEDC_TICK_SEL_HSTIMER2_S  25

/* LEDC_HSTIMER2_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset high speed timer2 the counter
 * will be 0 after reset.
 */

#define LEDC_HSTIMER2_RST  (BIT(24))
#define LEDC_HSTIMER2_RST_M  (BIT(24))
#define LEDC_HSTIMER2_RST_V  0x1
#define LEDC_HSTIMER2_RST_S  24

/* LEDC_HSTIMER2_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in high
 * speed timer2
 */

#define LEDC_HSTIMER2_PAUSE  (BIT(23))
#define LEDC_HSTIMER2_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER2_PAUSE_V  0x1
#define LEDC_HSTIMER2_PAUSE_S  23

/* LEDC_DIV_NUM_HSTIMER2 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter for divider
 * in high speed timer2 the least significant eight bits represent
 * the decimal part.
 */

#define LEDC_DIV_NUM_HSTIMER2  0x0003FFFF
#define LEDC_DIV_NUM_HSTIMER2_M  ((LEDC_DIV_NUM_HSTIMER2_V)<<(LEDC_DIV_NUM_HSTIMER2_S))
#define LEDC_DIV_NUM_HSTIMER2_V  0x3FFFF
#define LEDC_DIV_NUM_HSTIMER2_S  5

/* LEDC_HSTIMER2_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in high speed timer2. the counter range is [0 2**reg_hstimer2_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_HSTIMER2_DUTY_RES  0x0000001F
#define LEDC_HSTIMER2_DUTY_RES_M  ((LEDC_HSTIMER2_DUTY_RES_V)<<(LEDC_HSTIMER2_DUTY_RES_S))
#define LEDC_HSTIMER2_DUTY_RES_V  0x1F
#define LEDC_HSTIMER2_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_HSTIMER2_LIM       LEDC_HSTIMER2_DUTY_RES
#define LEDC_HSTIMER2_LIM_M     LEDC_HSTIMER2_DUTY_RES_M
#define LEDC_HSTIMER2_LIM_V     LEDC_HSTIMER2_DUTY_RES_V
#define LEDC_HSTIMER2_LIM_S     LEDC_HSTIMER2_DUTY_RES_S

#define LEDC_HSTIMER2_VALUE_REG          (DR_REG_LEDC_BASE + 0x0154)

/* LEDC_HSTIMER2_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in high speed timer2
 */

#define LEDC_HSTIMER2_CNT  0x000FFFFF
#define LEDC_HSTIMER2_CNT_M  ((LEDC_HSTIMER2_CNT_V)<<(LEDC_HSTIMER2_CNT_S))
#define LEDC_HSTIMER2_CNT_V  0xFFFFF
#define LEDC_HSTIMER2_CNT_S  0

#define LEDC_HSTIMER3_CONF_REG          (DR_REG_LEDC_BASE + 0x0158)

/* LEDC_TICK_SEL_HSTIMER3 : R/W ;bitpos:[25] ;default: 1'b0 ; */

