apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* Description: This bit is used to choose apb_clk or ref_tick
 * for high speed timer3.
 * 1'b1:apb_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_HSTIMER3  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER3_M  (BIT(25))
#define LEDC_TICK_SEL_HSTIMER3_V  0x1
#define LEDC_TICK_SEL_HSTIMER3_S  25

/* LEDC_HSTIMER3_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset high speed timer3
 * the counter will be 0 after reset.
 */

#define LEDC_HSTIMER3_RST  (BIT(24))
#define LEDC_HSTIMER3_RST_M  (BIT(24))
#define LEDC_HSTIMER3_RST_V  0x1
#define LEDC_HSTIMER3_RST_S  24

/* LEDC_HSTIMER3_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter
 * in high speed timer3
 */

#define LEDC_HSTIMER3_PAUSE  (BIT(23))
#define LEDC_HSTIMER3_PAUSE_M  (BIT(23))
#define LEDC_HSTIMER3_PAUSE_V  0x1
#define LEDC_HSTIMER3_PAUSE_S  23

/* LEDC_DIV_NUM_HSTIMER3 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter
 * for divider in high speed timer3 the least significant eight bits
 * represent the decimal part.
 */

#define LEDC_DIV_NUM_HSTIMER3  0x0003FFFF
#define LEDC_DIV_NUM_HSTIMER3_M  ((LEDC_DIV_NUM_HSTIMER3_V)<<(LEDC_DIV_NUM_HSTIMER3_S))
#define LEDC_DIV_NUM_HSTIMER3_V  0x3FFFF
#define LEDC_DIV_NUM_HSTIMER3_S  5

/* LEDC_HSTIMER3_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in high speed timer3. The counter range is [0 2**reg_hstimer3_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_HSTIMER3_DUTY_RES  0x0000001F
#define LEDC_HSTIMER3_DUTY_RES_M  ((LEDC_HSTIMER3_DUTY_RES_V)<<(LEDC_HSTIMER3_DUTY_RES_S))
#define LEDC_HSTIMER3_DUTY_RES_V  0x1F
#define LEDC_HSTIMER3_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_HSTIMER3_LIM       LEDC_HSTIMER3_DUTY_RES
#define LEDC_HSTIMER3_LIM_M     LEDC_HSTIMER3_DUTY_RES_M
#define LEDC_HSTIMER3_LIM_V     LEDC_HSTIMER3_DUTY_RES_V
#define LEDC_HSTIMER3_LIM_S     LEDC_HSTIMER3_DUTY_RES_S

#define LEDC_HSTIMER3_VALUE_REG          (DR_REG_LEDC_BASE + 0x015C)

/* LEDC_HSTIMER3_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in high speed timer3
 */

#define LEDC_HSTIMER3_CNT  0x000FFFFF
#define LEDC_HSTIMER3_CNT_M  ((LEDC_HSTIMER3_CNT_V)<<(LEDC_HSTIMER3_CNT_S))
#define LEDC_HSTIMER3_CNT_V  0xFFFFF
#define LEDC_HSTIMER3_CNT_S  0

#define LEDC_LSTIMER0_CONF_REG          (DR_REG_LEDC_BASE + 0x0160)

/* LEDC_LSTIMER0_PARA_UP : R/W ;bitpos:[26] ;default: 1'h0 ; */

/* Description: Set this bit  to update  reg_div_num_lstime0
 * and reg_lstimer0_lim.
 */

#define LEDC_LSTIMER0_PARA_UP  (BIT(26))
#define LEDC_LSTIMER0_PARA_UP_M  (BIT(26))
#define LEDC_LSTIMER0_PARA_UP_V  0x1
#define LEDC_LSTIMER0_PARA_UP_S  26

/* LEDC_TICK_SEL_LSTIMER0 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose slow_clk or ref_tick
 * for low speed timer0.
 * 1'b1:slow_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_LSTIMER0  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER0_M  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER0_V  0x1
#define LEDC_TICK_SEL_LSTIMER0_S  25

/* LEDC_LSTIMER0_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset low speed timer0 the counter
 * will be 0 after reset.
 */

#define LEDC_LSTIMER0_RST  (BIT(24))
#define LEDC_LSTIMER0_RST_M  (BIT(24))
#define LEDC_LSTIMER0_RST_V  0x1
#define LEDC_LSTIMER0_RST_S  24

/* LEDC_LSTIMER0_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in low speed timer0. */

#define LEDC_LSTIMER0_PAUSE  (BIT(23))
#define LEDC_LSTIMER0_PAUSE_M  (BIT(23))
#define LEDC_LSTIMER0_PAUSE_V  0x1
#define LEDC_LSTIMER0_PAUSE_S  23

/* LEDC_DIV_NUM_LSTIMER0 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter
 * for divider in low speed timer0 the least significant eight bits
 * represent the decimal part.
 */

#define LEDC_DIV_NUM_LSTIMER0  0x0003FFFF
#define LEDC_DIV_NUM_LSTIMER0_M  ((LEDC_DIV_NUM_LSTIMER0_V)<<(LEDC_DIV_NUM_LSTIMER0_S))
#define LEDC_DIV_NUM_LSTIMER0_V  0x3FFFF
#define LEDC_DIV_NUM_LSTIMER0_S  5

/* LEDC_LSTIMER0_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in low speed timer0. the counter range is [0 2**reg_lstimer0_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_LSTIMER0_DUTY_RES  0x0000001F
#define LEDC_LSTIMER0_DUTY_RES_M  ((LEDC_LSTIMER0_DUTY_RES_V)<<(LEDC_LSTIMER0_DUTY_RES_S))
#define LEDC_LSTIMER0_DUTY_RES_V  0x1F
#define LEDC_LSTIMER0_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_LSTIMER0_LIM       LEDC_LSTIMER0_DUTY_RES
#define LEDC_LSTIMER0_LIM_M     LEDC_LSTIMER0_DUTY_RES_M
#define LEDC_LSTIMER0_LIM_V     LEDC_LSTIMER0_DUTY_RES_V
#define LEDC_LSTIMER0_LIM_S     LEDC_LSTIMER0_DUTY_RES_S

#define LEDC_LSTIMER0_VALUE_REG          (DR_REG_LEDC_BASE + 0x0164)

/* LEDC_LSTIMER0_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in low speed timer0.
 */

#define LEDC_LSTIMER0_CNT  0x000FFFFF
#define LEDC_LSTIMER0_CNT_M  ((LEDC_LSTIMER0_CNT_V)<<(LEDC_LSTIMER0_CNT_S))
#define LEDC_LSTIMER0_CNT_V  0xFFFFF
#define LEDC_LSTIMER0_CNT_S  0

#define LEDC_LSTIMER1_CONF_REG          (DR_REG_LEDC_BASE + 0x0168)

/* LEDC_LSTIMER1_PARA_UP : R/W ;bitpos:[26] ;default: 1'h0 ; */

/* Description: Set this bit to update reg_div_num_lstime1
 * and reg_lstimer1_lim.
 */

#define LEDC_LSTIMER1_PARA_UP  (BIT(26))
#define LEDC_LSTIMER1_PARA_UP_M  (BIT(26))
#define LEDC_LSTIMER1_PARA_UP_V  0x1
#define LEDC_LSTIMER1_PARA_UP_S  26

/* LEDC_TICK_SEL_LSTIMER1 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose slow_clk or ref_tick
 * for low speed timer1.
 * 1:slow_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_LSTIMER1  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER1_M  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER1_V  0x1
#define LEDC_TICK_SEL_LSTIMER1_S  25

/* LEDC_LSTIMER1_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset low speed timer1 the counter
 * will be 0 after reset.
 */

#define LEDC_LSTIMER1_RST  (BIT(24))
#define LEDC_LSTIMER1_RST_M  (BIT(24))
#define LEDC_LSTIMER1_RST_V  0x1
#define LEDC_LSTIMER1_RST_S  24

/* LEDC_LSTIMER1_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter
 * in low speed timer1.
 */

#define LEDC_LSTIMER1_PAUSE  (BIT(23))
#define LEDC_LSTIMER1_PAUSE_M  (BIT(23))
#define LEDC_LSTIMER1_PAUSE_V  0x1
#define LEDC_LSTIMER1_PAUSE_S  23

/* LEDC_DIV_NUM_LSTIMER1 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter for divider
 * in low speed timer1 the least significant eight bits represent the
 * decimal part.
 */

#define LEDC_DIV_NUM_LSTIMER1  0x0003FFFF
#define LEDC_DIV_NUM_LSTIMER1_M  ((LEDC_DIV_NUM_LSTIMER1_V)<<(LEDC_DIV_NUM_LSTIMER1_S))
#define LEDC_DIV_NUM_LSTIMER1_V  0x3FFFF
#define LEDC_DIV_NUM_LSTIMER1_S  5

/* LEDC_LSTIMER1_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in low speed timer1. The counter range is [0 2**reg_lstimer1_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_LSTIMER1_DUTY_RES  0x0000001F
#define LEDC_LSTIMER1_DUTY_RES_M  ((LEDC_LSTIMER1_DUTY_RES_V)<<(LEDC_LSTIMER1_DUTY_RES_S))
#define LEDC_LSTIMER1_DUTY_RES_V  0x1F
#define LEDC_LSTIMER1_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_LSTIMER1_LIM       LEDC_LSTIMER1_DUTY_RES
#define LEDC_LSTIMER1_LIM_M     LEDC_LSTIMER1_DUTY_RES_M
#define LEDC_LSTIMER1_LIM_V     LEDC_LSTIMER1_DUTY_RES_V
#define LEDC_LSTIMER1_LIM_S     LEDC_LSTIMER1_DUTY_RES_S

#define LEDC_LSTIMER1_VALUE_REG          (DR_REG_LEDC_BASE + 0x016C)

