apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* LEDC_LSTIMER1_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in low speed timer1.
 */

#define LEDC_LSTIMER1_CNT  0x000FFFFF
#define LEDC_LSTIMER1_CNT_M  ((LEDC_LSTIMER1_CNT_V)<<(LEDC_LSTIMER1_CNT_S))
#define LEDC_LSTIMER1_CNT_V  0xFFFFF
#define LEDC_LSTIMER1_CNT_S  0

#define LEDC_LSTIMER2_CONF_REG          (DR_REG_LEDC_BASE + 0x0170)

/* LEDC_LSTIMER2_PARA_UP : R/W ;bitpos:[26] ;default: 1'h0 ; */

/* Description: Set this bit to update reg_div_num_lstime2
 * and reg_lstimer2_lim.
 */

#define LEDC_LSTIMER2_PARA_UP  (BIT(26))
#define LEDC_LSTIMER2_PARA_UP_M  (BIT(26))
#define LEDC_LSTIMER2_PARA_UP_V  0x1
#define LEDC_LSTIMER2_PARA_UP_S  26

/* LEDC_TICK_SEL_LSTIMER2 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose slow_clk or ref_tick
 * for low speed timer2.
 * 1:slow_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_LSTIMER2  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER2_M  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER2_V  0x1
#define LEDC_TICK_SEL_LSTIMER2_S  25

/* LEDC_LSTIMER2_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset low speed timer2 the counter
 * will be 0 after reset.
 */

#define LEDC_LSTIMER2_RST  (BIT(24))
#define LEDC_LSTIMER2_RST_M  (BIT(24))
#define LEDC_LSTIMER2_RST_V  0x1
#define LEDC_LSTIMER2_RST_S  24

/* LEDC_LSTIMER2_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in low speed timer2. */

#define LEDC_LSTIMER2_PAUSE  (BIT(23))
#define LEDC_LSTIMER2_PAUSE_M  (BIT(23))
#define LEDC_LSTIMER2_PAUSE_V  0x1
#define LEDC_LSTIMER2_PAUSE_S  23

/* LEDC_DIV_NUM_LSTIMER2 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter
 * for divider in low speed timer2 the least significant eight bits
 * represent the decimal part.
 */

#define LEDC_DIV_NUM_LSTIMER2  0x0003FFFF
#define LEDC_DIV_NUM_LSTIMER2_M  ((LEDC_DIV_NUM_LSTIMER2_V)<<(LEDC_DIV_NUM_LSTIMER2_S))
#define LEDC_DIV_NUM_LSTIMER2_V  0x3FFFF
#define LEDC_DIV_NUM_LSTIMER2_S  5

/* LEDC_LSTIMER2_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in low speed timer2. the counter range is [0 2**reg_lstimer2_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_LSTIMER2_DUTY_RES  0x0000001F
#define LEDC_LSTIMER2_DUTY_RES_M  ((LEDC_LSTIMER2_DUTY_RES_V)<<(LEDC_LSTIMER2_DUTY_RES_S))
#define LEDC_LSTIMER2_DUTY_RES_V  0x1F
#define LEDC_LSTIMER2_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_LSTIMER2_LIM       LEDC_LSTIMER2_DUTY_RES
#define LEDC_LSTIMER2_LIM_M     LEDC_LSTIMER2_DUTY_RES_M
#define LEDC_LSTIMER2_LIM_V     LEDC_LSTIMER2_DUTY_RES_V
#define LEDC_LSTIMER2_LIM_S     LEDC_LSTIMER2_DUTY_RES_S

#define LEDC_LSTIMER2_VALUE_REG          (DR_REG_LEDC_BASE + 0x0174)

/* LEDC_LSTIMER2_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in low speed timer2.
 */

#define LEDC_LSTIMER2_CNT  0x000FFFFF
#define LEDC_LSTIMER2_CNT_M  ((LEDC_LSTIMER2_CNT_V)<<(LEDC_LSTIMER2_CNT_S))
#define LEDC_LSTIMER2_CNT_V  0xFFFFF
#define LEDC_LSTIMER2_CNT_S  0

#define LEDC_LSTIMER3_CONF_REG          (DR_REG_LEDC_BASE + 0x0178)

/* LEDC_LSTIMER3_PARA_UP : R/W ;bitpos:[26] ;default: 1'h0 ; */

/* Description: Set this bit to update reg_div_num_lstime3
 * and reg_lstimer3_lim.
 */

#define LEDC_LSTIMER3_PARA_UP  (BIT(26))
#define LEDC_LSTIMER3_PARA_UP_M  (BIT(26))
#define LEDC_LSTIMER3_PARA_UP_V  0x1
#define LEDC_LSTIMER3_PARA_UP_S  26

/* LEDC_TICK_SEL_LSTIMER3 : R/W ;bitpos:[25] ;default: 1'b0 ; */

/* Description: This bit is used to choose slow_clk or ref_tick
 * for low speed timer3.
 * 1:slow_clk
 * 0:ref_tick
 */

#define LEDC_TICK_SEL_LSTIMER3  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER3_M  (BIT(25))
#define LEDC_TICK_SEL_LSTIMER3_V  0x1
#define LEDC_TICK_SEL_LSTIMER3_S  25

/* LEDC_LSTIMER3_RST : R/W ;bitpos:[24] ;default: 1'b1 ; */

/* Description: This bit is used to reset low speed timer3 the counter
 * will be 0 after reset.
 */

#define LEDC_LSTIMER3_RST  (BIT(24))
#define LEDC_LSTIMER3_RST_M  (BIT(24))
#define LEDC_LSTIMER3_RST_V  0x1
#define LEDC_LSTIMER3_RST_S  24

/* LEDC_LSTIMER3_PAUSE : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: This bit is used to pause the counter in low speed timer3. */

#define LEDC_LSTIMER3_PAUSE  (BIT(23))
#define LEDC_LSTIMER3_PAUSE_M  (BIT(23))
#define LEDC_LSTIMER3_PAUSE_V  0x1
#define LEDC_LSTIMER3_PAUSE_S  23

/* LEDC_DIV_NUM_LSTIMER3 : R/W ;bitpos:[22:5] ;default: 18'h0 ; */

/* Description: This register is used to configure parameter for divider
 * in low speed timer3 the least significant eight bits represent the
 * decimal part.
 */

#define LEDC_DIV_NUM_LSTIMER3  0x0003FFFF
#define LEDC_DIV_NUM_LSTIMER3_M  ((LEDC_DIV_NUM_LSTIMER3_V)<<(LEDC_DIV_NUM_LSTIMER3_S))
#define LEDC_DIV_NUM_LSTIMER3_V  0x3FFFF
#define LEDC_DIV_NUM_LSTIMER3_S  5

/* LEDC_LSTIMER3_LIM : R/W ;bitpos:[4:0] ;default: 5'h0 ; */

/* Description: This register controls the range of the counter
 * in low speed timer3. the counter range is [0 2**reg_lstimer3_lim]
 * the max bit width for counter is 20.
 */

#define LEDC_LSTIMER3_DUTY_RES  0x0000001F
#define LEDC_LSTIMER3_DUTY_RES_M  ((LEDC_LSTIMER3_DUTY_RES_V)<<(LEDC_LSTIMER3_DUTY_RES_S))
#define LEDC_LSTIMER3_DUTY_RES_V  0x1F
#define LEDC_LSTIMER3_DUTY_RES_S  0

/* Keep the definitions below to be compatible with previous version */

#define LEDC_LSTIMER3_LIM       LEDC_LSTIMER3_DUTY_RES
#define LEDC_LSTIMER3_LIM_M     LEDC_LSTIMER3_DUTY_RES_M
#define LEDC_LSTIMER3_LIM_V     LEDC_LSTIMER3_DUTY_RES_V
#define LEDC_LSTIMER3_LIM_S     LEDC_LSTIMER3_DUTY_RES_S

#define LEDC_LSTIMER3_VALUE_REG          (DR_REG_LEDC_BASE + 0x017C)

/* LEDC_LSTIMER3_CNT : RO ;bitpos:[19:0] ;default: 20'b0 ; */

/* Description: software can read this register to get the current
 * counter value in low speed timer3.
 */

#define LEDC_LSTIMER3_CNT  0x000FFFFF
#define LEDC_LSTIMER3_CNT_M  ((LEDC_LSTIMER3_CNT_V)<<(LEDC_LSTIMER3_CNT_S))
#define LEDC_LSTIMER3_CNT_V  0xFFFFF
#define LEDC_LSTIMER3_CNT_S  0

#define LEDC_INT_RAW_REG          (DR_REG_LEDC_BASE + 0x0180)

/* LEDC_DUTY_CHNG_END_LSCH7_INT_RAW : RO ;bitpos:[23] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 7 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_RAW_S  23

