apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* LEDC_DUTY_CHNG_END_LSCH6_INT_RAW : RO ;bitpos:[22] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 6 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_RAW_S  22

/* LEDC_DUTY_CHNG_END_LSCH5_INT_RAW : RO ;bitpos:[21] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 5 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_RAW_S  21

/* LEDC_DUTY_CHNG_END_LSCH4_INT_RAW : RO ;bitpos:[20] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 4 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_RAW_S  20

/* LEDC_DUTY_CHNG_END_LSCH3_INT_RAW : RO ;bitpos:[19] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 3 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_RAW_S  19

/* LEDC_DUTY_CHNG_END_LSCH2_INT_RAW : RO ;bitpos:[18] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 2 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_RAW_S  18

/* LEDC_DUTY_CHNG_END_LSCH1_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 1 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_RAW_S  17

/* LEDC_DUTY_CHNG_END_LSCH0_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel 0 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_RAW_S  16

/* LEDC_DUTY_CHNG_END_HSCH7_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 7 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_RAW_S  15

/* LEDC_DUTY_CHNG_END_HSCH6_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 6 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_RAW_S  14

/* LEDC_DUTY_CHNG_END_HSCH5_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 5 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_RAW_S  13

/* LEDC_DUTY_CHNG_END_HSCH4_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 4 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_RAW_S  12

/* LEDC_DUTY_CHNG_END_HSCH3_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 3 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_RAW_S  11

/* LEDC_DUTY_CHNG_END_HSCH2_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 2 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_RAW_S  10

/* LEDC_DUTY_CHNG_END_HSCH1_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 1 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_RAW_S  9

/* LEDC_DUTY_CHNG_END_HSCH0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel 0 duty
 * change done.
 */

#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_RAW_S  8

/* LEDC_LSTIMER3_OVF_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel3
 * counter overflow.
 */

#define LEDC_LSTIMER3_OVF_INT_RAW  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_RAW_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER3_OVF_INT_RAW_S  7

/* LEDC_LSTIMER2_OVF_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel2
 * counter overflow.
 */

#define LEDC_LSTIMER2_OVF_INT_RAW  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_RAW_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER2_OVF_INT_RAW_S  6

/* LEDC_LSTIMER1_OVF_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel1
 * counter overflow.
 */

