apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
#define LEDC_LSTIMER1_OVF_INT_RAW  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_RAW_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER1_OVF_INT_RAW_S  5

/* LEDC_LSTIMER0_OVF_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for low speed channel0
 * counter overflow.
 */

#define LEDC_LSTIMER0_OVF_INT_RAW  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_RAW_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_RAW_V  0x1
#define LEDC_LSTIMER0_OVF_INT_RAW_S  4

/* LEDC_HSTIMER3_OVF_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel3
 * counter overflow.
 */

#define LEDC_HSTIMER3_OVF_INT_RAW  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_RAW_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER3_OVF_INT_RAW_S  3

/* LEDC_HSTIMER2_OVF_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel2
 * counter overflow.
 */

#define LEDC_HSTIMER2_OVF_INT_RAW  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_RAW_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER2_OVF_INT_RAW_S  2

/* LEDC_HSTIMER1_OVF_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel1
 * counter overflow.
 */

#define LEDC_HSTIMER1_OVF_INT_RAW  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_RAW_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER1_OVF_INT_RAW_S  1

/* LEDC_HSTIMER0_OVF_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The interrupt raw bit for high speed channel0
 * counter overflow.
 */

#define LEDC_HSTIMER0_OVF_INT_RAW  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_RAW_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_RAW_V  0x1
#define LEDC_HSTIMER0_OVF_INT_RAW_S  0

#define LEDC_INT_ST_REG          (DR_REG_LEDC_BASE + 0x0184)

/* LEDC_DUTY_CHNG_END_LSCH7_INT_ST : RO ;bitpos:[23] ;default: 1'h0 ; */

/* Description: The interrupt status bit for low speed channel 7 duty
 * change done event
 */

#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ST_S  23

/* LEDC_DUTY_CHNG_END_LSCH6_INT_ST : RO ;bitpos:[22] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 6 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ST_S  22

/* LEDC_DUTY_CHNG_END_LSCH5_INT_ST : RO ;bitpos:[21] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 5 duty change
 * done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ST_S  21

/* LEDC_DUTY_CHNG_END_LSCH4_INT_ST : RO ;bitpos:[20] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 4 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ST_S  20

/* LEDC_DUTY_CHNG_END_LSCH3_INT_ST : RO ;bitpos:[19] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 3 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ST_S  19

/* LEDC_DUTY_CHNG_END_LSCH2_INT_ST : RO ;bitpos:[18] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 2 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ST_S  18

/* LEDC_DUTY_CHNG_END_LSCH1_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 1 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ST_S  17

/* LEDC_DUTY_CHNG_END_LSCH0_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel 0 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ST_S  16

/* LEDC_DUTY_CHNG_END_HSCH7_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 7 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ST_S  15

/* LEDC_DUTY_CHNG_END_HSCH6_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 6 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ST_S  14

/* LEDC_DUTY_CHNG_END_HSCH5_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 5 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ST_S  13

/* LEDC_DUTY_CHNG_END_HSCH4_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 4 duty
 * change done event.
 */

