apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ST_S  12

/* LEDC_DUTY_CHNG_END_HSCH3_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 3 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ST_S  11

/* LEDC_DUTY_CHNG_END_HSCH2_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 2 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ST_S  10

/* LEDC_DUTY_CHNG_END_HSCH1_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 1 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ST_S  9

/* LEDC_DUTY_CHNG_END_HSCH0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel 0 duty
 * change done event.
 */

#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ST_S  8

/* LEDC_LSTIMER3_OVF_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel3
 * counter overflow event.
 */

#define LEDC_LSTIMER3_OVF_INT_ST  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ST_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ST_S  7

/* LEDC_LSTIMER2_OVF_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel2
 * counter overflow event.
 */

#define LEDC_LSTIMER2_OVF_INT_ST  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ST_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ST_S  6

/* LEDC_LSTIMER1_OVF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel1
 * counter overflow event.
 */

#define LEDC_LSTIMER1_OVF_INT_ST  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ST_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ST_S  5

/* LEDC_LSTIMER0_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The interrupt status bit for low speed channel0
 * counter overflow event.
 */

#define LEDC_LSTIMER0_OVF_INT_ST  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ST_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ST_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ST_S  4

/* LEDC_HSTIMER3_OVF_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel3
 * counter overflow event.
 */

#define LEDC_HSTIMER3_OVF_INT_ST  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ST_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER3_OVF_INT_ST_S  3

/* LEDC_HSTIMER2_OVF_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel2
 * counter overflow event.
 */

#define LEDC_HSTIMER2_OVF_INT_ST  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ST_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER2_OVF_INT_ST_S  2

/* LEDC_HSTIMER1_OVF_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel1
 * counter overflow event.
 */

#define LEDC_HSTIMER1_OVF_INT_ST  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ST_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER1_OVF_INT_ST_S  1

/* LEDC_HSTIMER0_OVF_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The interrupt status bit for high speed channel0
 * counter overflow event.
 */

#define LEDC_HSTIMER0_OVF_INT_ST  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ST_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ST_V  0x1
#define LEDC_HSTIMER0_OVF_INT_ST_S  0

#define LEDC_INT_ENA_REG          (DR_REG_LEDC_BASE + 0x0188)

/* LEDC_DUTY_CHNG_END_LSCH7_INT_ENA : R/W ;bitpos:[23] ;default: 1'h0 ; */

/* Description: The interrupt enable bit for low speed channel 7 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_ENA_S  23

/* LEDC_DUTY_CHNG_END_LSCH6_INT_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 6 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_ENA_S  22

/* LEDC_DUTY_CHNG_END_LSCH5_INT_ENA : R/W ;bitpos:[21] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 5 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_ENA_S  21

/* LEDC_DUTY_CHNG_END_LSCH4_INT_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 4 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_ENA_S  20

/* LEDC_DUTY_CHNG_END_LSCH3_INT_ENA : R/W ;bitpos:[19] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 3 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_ENA_S  19

/* LEDC_DUTY_CHNG_END_LSCH2_INT_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 2 duty
 * change done interrupt.
 */

