apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_ENA_S  18

/* LEDC_DUTY_CHNG_END_LSCH1_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 1 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_ENA_S  17

/* LEDC_DUTY_CHNG_END_LSCH0_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel 0 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_ENA_S  16

/* LEDC_DUTY_CHNG_END_HSCH7_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 7 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_ENA_S  15

/* LEDC_DUTY_CHNG_END_HSCH6_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 6 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_ENA_S  14

/* LEDC_DUTY_CHNG_END_HSCH5_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 5 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_ENA_S  13

/* LEDC_DUTY_CHNG_END_HSCH4_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 4 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_ENA_S  12

/* LEDC_DUTY_CHNG_END_HSCH3_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 3 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_ENA_S  11

/* LEDC_DUTY_CHNG_END_HSCH2_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 2 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_ENA_S  10

/* LEDC_DUTY_CHNG_END_HSCH1_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 1 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_ENA_S  9

/* LEDC_DUTY_CHNG_END_HSCH0_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel 0 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_ENA_S  8

/* LEDC_LSTIMER3_OVF_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel3  counter
 * overflow interrupt.
 */

#define LEDC_LSTIMER3_OVF_INT_ENA  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ENA_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER3_OVF_INT_ENA_S  7

/* LEDC_LSTIMER2_OVF_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel2  counter
 * overflow interrupt.
 */

#define LEDC_LSTIMER2_OVF_INT_ENA  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ENA_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER2_OVF_INT_ENA_S  6

/* LEDC_LSTIMER1_OVF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel1
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER1_OVF_INT_ENA  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ENA_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER1_OVF_INT_ENA_S  5

/* LEDC_LSTIMER0_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for low speed channel0
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER0_OVF_INT_ENA  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ENA_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_LSTIMER0_OVF_INT_ENA_S  4

/* LEDC_HSTIMER3_OVF_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel3
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER3_OVF_INT_ENA  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ENA_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER3_OVF_INT_ENA_S  3

/* LEDC_HSTIMER2_OVF_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel2
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER2_OVF_INT_ENA  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ENA_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER2_OVF_INT_ENA_S  2

/* LEDC_HSTIMER1_OVF_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The interrupt enable bit for high speed channel1
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER1_OVF_INT_ENA  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ENA_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER1_OVF_INT_ENA_S  1

/* LEDC_HSTIMER0_OVF_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

