apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* Description: The interrupt enable bit for high speed channel0
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER0_OVF_INT_ENA  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ENA_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_ENA_V  0x1
#define LEDC_HSTIMER0_OVF_INT_ENA_S  0

#define LEDC_INT_CLR_REG          (DR_REG_LEDC_BASE + 0x018C)

/* LEDC_DUTY_CHNG_END_LSCH7_INT_CLR : WO ;bitpos:[23] ;default: 1'h0 ; */

/* Description: Set this  bit to clear  low speed channel 7 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_M  (BIT(23))
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH7_INT_CLR_S  23

/* LEDC_DUTY_CHNG_END_LSCH6_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 6 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_M  (BIT(22))
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH6_INT_CLR_S  22

/* LEDC_DUTY_CHNG_END_LSCH5_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 5 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_M  (BIT(21))
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH5_INT_CLR_S  21

/* LEDC_DUTY_CHNG_END_LSCH4_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 4 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_M  (BIT(20))
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH4_INT_CLR_S  20

/* LEDC_DUTY_CHNG_END_LSCH3_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 3 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_M  (BIT(19))
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH3_INT_CLR_S  19

/* LEDC_DUTY_CHNG_END_LSCH2_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 2 duty change
 * done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_M  (BIT(18))
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH2_INT_CLR_S  18

/* LEDC_DUTY_CHNG_END_LSCH1_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 1 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_M  (BIT(17))
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH1_INT_CLR_S  17

/* LEDC_DUTY_CHNG_END_LSCH0_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel 0 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_M  (BIT(16))
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_LSCH0_INT_CLR_S  16

/* LEDC_DUTY_CHNG_END_HSCH7_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 7 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_M  (BIT(15))
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH7_INT_CLR_S  15

/* LEDC_DUTY_CHNG_END_HSCH6_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 6 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_M  (BIT(14))
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH6_INT_CLR_S  14

/* LEDC_DUTY_CHNG_END_HSCH5_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 5 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_M  (BIT(13))
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH5_INT_CLR_S  13

/* LEDC_DUTY_CHNG_END_HSCH4_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 4 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_M  (BIT(12))
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH4_INT_CLR_S  12

/* LEDC_DUTY_CHNG_END_HSCH3_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 3 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_M  (BIT(11))
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH3_INT_CLR_S  11

/* LEDC_DUTY_CHNG_END_HSCH2_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 2 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_M  (BIT(10))
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH2_INT_CLR_S  10

/* LEDC_DUTY_CHNG_END_HSCH1_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel 1 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_M  (BIT(9))
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH1_INT_CLR_S  9

/* LEDC_DUTY_CHNG_END_HSCH0_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */

