apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_ledc.h
/* Description: Set this  bit to clear  high speed channel 0 duty
 * change done interrupt.
 */

#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_M  (BIT(8))
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_V  0x1
#define LEDC_DUTY_CHNG_END_HSCH0_INT_CLR_S  8

/* LEDC_LSTIMER3_OVF_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel3
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER3_OVF_INT_CLR  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_CLR_M  (BIT(7))
#define LEDC_LSTIMER3_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER3_OVF_INT_CLR_S  7

/* LEDC_LSTIMER2_OVF_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  low speed channel2
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER2_OVF_INT_CLR  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_CLR_M  (BIT(6))
#define LEDC_LSTIMER2_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER2_OVF_INT_CLR_S  6

/* LEDC_LSTIMER1_OVF_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */

/* Description: Set this  bit to clear low speed channel1
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER1_OVF_INT_CLR  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_CLR_M  (BIT(5))
#define LEDC_LSTIMER1_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER1_OVF_INT_CLR_S  5

/* LEDC_LSTIMER0_OVF_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: Set this  bit to clear low speed channel0
 * counter overflow interrupt.
 */

#define LEDC_LSTIMER0_OVF_INT_CLR  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_CLR_M  (BIT(4))
#define LEDC_LSTIMER0_OVF_INT_CLR_V  0x1
#define LEDC_LSTIMER0_OVF_INT_CLR_S  4

/* LEDC_HSTIMER3_OVF_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: Set this bit to clear high speed channel3
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER3_OVF_INT_CLR  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_CLR_M  (BIT(3))
#define LEDC_HSTIMER3_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER3_OVF_INT_CLR_S  3

/* LEDC_HSTIMER2_OVF_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: Set this bit to clear high speed channel2
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER2_OVF_INT_CLR  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_CLR_M  (BIT(2))
#define LEDC_HSTIMER2_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER2_OVF_INT_CLR_S  2

/* LEDC_HSTIMER1_OVF_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */

/* Description: Set this  bit to clear high speed channel1
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER1_OVF_INT_CLR  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_CLR_M  (BIT(1))
#define LEDC_HSTIMER1_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER1_OVF_INT_CLR_S  1

/* LEDC_HSTIMER0_OVF_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */

/* Description: Set this  bit to clear  high speed channel0
 * counter overflow interrupt.
 */

#define LEDC_HSTIMER0_OVF_INT_CLR  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_CLR_M  (BIT(0))
#define LEDC_HSTIMER0_OVF_INT_CLR_V  0x1
#define LEDC_HSTIMER0_OVF_INT_CLR_S  0

#define LEDC_CONF_REG          (DR_REG_LEDC_BASE + 0x0190)

/* LEDC_APB_CLK_SEL : R/W ;bitpos:[0] ;default: 1'b0 ; */

/* Description: This bit is used to set the frequency of slow_clk.
 * 1'b1:80mhz
 * 1'b0:8mhz
 */

#define LEDC_APB_CLK_SEL  (BIT(0))
#define LEDC_APB_CLK_SEL_M  (BIT(0))
#define LEDC_APB_CLK_SEL_V  0x1
#define LEDC_APB_CLK_SEL_S  0

#define LEDC_DATE_REG          (DR_REG_LEDC_BASE + 0x01FC)

/* LEDC_DATE : R/W ;bitpos:[31:0] ;default: 32'h16031700 ; */

/* Description: This register represents the version. */

#define LEDC_DATE  0xFFFFFFFF
#define LEDC_DATE_M  ((LEDC_DATE_V)<<(LEDC_DATE_S))
#define LEDC_DATE_V  0xFFFFFFFF
#define LEDC_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32_HARDWARE_ESP32_LEDC_H */
